zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_VREF.h
/*
** ###################################################################
**     Processors:          MCXN246TVAB
**                          MCXN246VAB
**                          MCXN247TVAB
**                          MCXN247TVDF
**                          MCXN247TVKL
**                          MCXN247TVPB
**                          MCXN247VAB
**                          MCXN247VDF
**                          MCXN247VKL
**                          MCXN247VPB
**                          MCXN526TVDF_cm33_core0
**                          MCXN526TVDF_cm33_core1
**                          MCXN526TVKL_cm33_core0
**                          MCXN526TVKL_cm33_core1
**                          MCXN526VDF_cm33_core0
**                          MCXN526VDF_cm33_core1
**                          MCXN526VKL_cm33_core0
**                          MCXN526VKL_cm33_core1
**                          MCXN527TVAB_cm33_core0
**                          MCXN527TVAB_cm33_core1
**                          MCXN527TVDF_cm33_core0
**                          MCXN527TVDF_cm33_core1
**                          MCXN527TVKL_cm33_core0
**                          MCXN527TVKL_cm33_core1
**                          MCXN527VAB_cm33_core0
**                          MCXN527VAB_cm33_core1
**                          MCXN527VDF_cm33_core0
**                          MCXN527VDF_cm33_core1
**                          MCXN527VKL_cm33_core0
**                          MCXN527VKL_cm33_core1
**                          MCXN536TVAB_cm33_core0
**                          MCXN536TVAB_cm33_core1
**                          MCXN536TVDF_cm33_core0
**                          MCXN536TVDF_cm33_core1
**                          MCXN536TVKL_cm33_core0
**                          MCXN536TVKL_cm33_core1
**                          MCXN536TVPB_cm33_core0
**                          MCXN536TVPB_cm33_core1
**                          MCXN536VAB_cm33_core0
**                          MCXN536VAB_cm33_core1
**                          MCXN536VDF_cm33_core0
**                          MCXN536VDF_cm33_core1
**                          MCXN536VKL_cm33_core0
**                          MCXN536VKL_cm33_core1
**                          MCXN536VPB_cm33_core0
**                          MCXN536VPB_cm33_core1
**                          MCXN537TVAB_cm33_core0
**                          MCXN537TVAB_cm33_core1
**                          MCXN537TVDF_cm33_core0
**                          MCXN537TVDF_cm33_core1
**                          MCXN537TVKL_cm33_core0
**                          MCXN537TVKL_cm33_core1
**                          MCXN537TVPB_cm33_core0
**                          MCXN537TVPB_cm33_core1
**                          MCXN537VAB_cm33_core0
**                          MCXN537VAB_cm33_core1
**                          MCXN537VDF_cm33_core0
**                          MCXN537VDF_cm33_core1
**                          MCXN537VKL_cm33_core0
**                          MCXN537VKL_cm33_core1
**                          MCXN537VPB_cm33_core0
**                          MCXN537VPB_cm33_core1
**                          MCXN546TVAB_cm33_core0
**                          MCXN546TVAB_cm33_core1
**                          MCXN546TVDF_cm33_core0
**                          MCXN546TVDF_cm33_core1
**                          MCXN546TVKL_cm33_core0
**                          MCXN546TVKL_cm33_core1
**                          MCXN546TVPB_cm33_core0
**                          MCXN546TVPB_cm33_core1
**                          MCXN546VAB_cm33_core0
**                          MCXN546VAB_cm33_core1
**                          MCXN546VDF_cm33_core0
**                          MCXN546VDF_cm33_core1
**                          MCXN546VKL_cm33_core0
**                          MCXN546VKL_cm33_core1
**                          MCXN546VNL_cm33_core0
**                          MCXN546VNL_cm33_core1
**                          MCXN546VPB_cm33_core0
**                          MCXN546VPB_cm33_core1
**                          MCXN547TVAB_cm33_core0
**                          MCXN547TVAB_cm33_core1
**                          MCXN547TVDF_cm33_core0
**                          MCXN547TVDF_cm33_core1
**                          MCXN547TVKL_cm33_core0
**                          MCXN547TVKL_cm33_core1
**                          MCXN547TVPB_cm33_core0
**                          MCXN547TVPB_cm33_core1
**                          MCXN547VAB_cm33_core0
**                          MCXN547VAB_cm33_core1
**                          MCXN547VDF_cm33_core0
**                          MCXN547VDF_cm33_core1
**                          MCXN547VKL_cm33_core0
**                          MCXN547VKL_cm33_core1
**                          MCXN547VNL_cm33_core0
**                          MCXN547VNL_cm33_core1
**                          MCXN547VPB_cm33_core0
**                          MCXN547VPB_cm33_core1
**                          MCXN556SCDF_cm33_core0
**                          MCXN556SCDF_cm33_core1
**                          MCXN556TCAB_cm33_core0
**                          MCXN556TCAB_cm33_core1
**                          MCXN556TCDF_cm33_core0
**                          MCXN556TCDF_cm33_core1
**                          MCXN556TVAB_cm33_core0
**                          MCXN556TVAB_cm33_core1
**                          MCXN556TVDF_cm33_core0
**                          MCXN556TVDF_cm33_core1
**                          MCXN557SCDF_cm33_core0
**                          MCXN557SCDF_cm33_core1
**                          MCXN557TCAB_cm33_core0
**                          MCXN557TCAB_cm33_core1
**                          MCXN557TCDF_cm33_core0
**                          MCXN557TCDF_cm33_core1
**                          MCXN557TVAB_cm33_core0
**                          MCXN557TVAB_cm33_core1
**                          MCXN557TVDF_cm33_core0
**                          MCXN557TVDF_cm33_core1
**                          MCXN946TVAB_cm33_core0
**                          MCXN946TVAB_cm33_core1
**                          MCXN946TVDF_cm33_core0
**                          MCXN946TVDF_cm33_core1
**                          MCXN946TVKL_cm33_core0
**                          MCXN946TVKL_cm33_core1
**                          MCXN946TVPB_cm33_core0
**                          MCXN946TVPB_cm33_core1
**                          MCXN946VAB_cm33_core0
**                          MCXN946VAB_cm33_core1
**                          MCXN946VDF_cm33_core0
**                          MCXN946VDF_cm33_core1
**                          MCXN946VKL_cm33_core0
**                          MCXN946VKL_cm33_core1
**                          MCXN946VNL_cm33_core0
**                          MCXN946VNL_cm33_core1
**                          MCXN946VPB_cm33_core0
**                          MCXN946VPB_cm33_core1
**                          MCXN947TVAB_cm33_core0
**                          MCXN947TVAB_cm33_core1
**                          MCXN947TVDF_cm33_core0
**                          MCXN947TVDF_cm33_core1
**                          MCXN947TVKL_cm33_core0
**                          MCXN947TVKL_cm33_core1
**                          MCXN947TVPB_cm33_core0
**                          MCXN947TVPB_cm33_core1
**                          MCXN947VAB_cm33_core0
**                          MCXN947VAB_cm33_core1
**                          MCXN947VDF_cm33_core0
**                          MCXN947VDF_cm33_core1
**                          MCXN947VKL_cm33_core0
**                          MCXN947VKL_cm33_core1
**                          MCXN947VNL_cm33_core0
**                          MCXN947VNL_cm33_core1
**                          MCXN947VPB_cm33_core0
**                          MCXN947VPB_cm33_core1
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b260812
**
**     Abstract:
**         CMSIS Peripheral Access Layer for VREF
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-10-01)
**         Initial version
**     - rev. 2.0 (2023-02-01)
**         Initial version based on Rev. 2 Draft B
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_VREF.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for VREF
 *
 * CMSIS Peripheral Access Layer for VREF
 */

#if !defined(PERI_VREF_H_)
#define PERI_VREF_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXN246VAB))
#include "MCXN246_COMMON.h"
#elif (defined(CPU_MCXN246TVAB))
#include "MCXN246T_COMMON.h"
#elif (defined(CPU_MCXN247VAB) || defined(CPU_MCXN247VDF) || defined(CPU_MCXN247VKL) || defined(CPU_MCXN247VPB))
#include "MCXN247_COMMON.h"
#elif (defined(CPU_MCXN247TVAB) || defined(CPU_MCXN247TVDF) || defined(CPU_MCXN247TVKL) || defined(CPU_MCXN247TVPB))
#include "MCXN247T_COMMON.h"
#elif (defined(CPU_MCXN526TVDF_cm33_core0) || defined(CPU_MCXN526TVKL_cm33_core0))
#include "MCXN526T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN526TVDF_cm33_core1) || defined(CPU_MCXN526TVKL_cm33_core1))
#include "MCXN526T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN526VDF_cm33_core0) || defined(CPU_MCXN526VKL_cm33_core0))
#include "MCXN526_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN526VDF_cm33_core1) || defined(CPU_MCXN526VKL_cm33_core1))
#include "MCXN526_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN527TVAB_cm33_core0) || defined(CPU_MCXN527TVDF_cm33_core0) || defined(CPU_MCXN527TVKL_cm33_core0))
#include "MCXN527T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN527TVAB_cm33_core1) || defined(CPU_MCXN527TVDF_cm33_core1) || defined(CPU_MCXN527TVKL_cm33_core1))
#include "MCXN527T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN527VAB_cm33_core0) || defined(CPU_MCXN527VDF_cm33_core0) || defined(CPU_MCXN527VKL_cm33_core0))
#include "MCXN527_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN527VAB_cm33_core1) || defined(CPU_MCXN527VDF_cm33_core1) || defined(CPU_MCXN527VKL_cm33_core1))
#include "MCXN527_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN536TVAB_cm33_core0) || defined(CPU_MCXN536TVDF_cm33_core0) || defined(CPU_MCXN536TVKL_cm33_core0) || defined(CPU_MCXN536TVPB_cm33_core0))
#include "MCXN536T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN536TVAB_cm33_core1) || defined(CPU_MCXN536TVDF_cm33_core1) || defined(CPU_MCXN536TVKL_cm33_core1) || defined(CPU_MCXN536TVPB_cm33_core1))
#include "MCXN536T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN536VAB_cm33_core0) || defined(CPU_MCXN536VDF_cm33_core0) || defined(CPU_MCXN536VKL_cm33_core0) || defined(CPU_MCXN536VPB_cm33_core0))
#include "MCXN536_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN536VAB_cm33_core1) || defined(CPU_MCXN536VDF_cm33_core1) || defined(CPU_MCXN536VKL_cm33_core1) || defined(CPU_MCXN536VPB_cm33_core1))
#include "MCXN536_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN537TVAB_cm33_core0) || defined(CPU_MCXN537TVDF_cm33_core0) || defined(CPU_MCXN537TVKL_cm33_core0) || defined(CPU_MCXN537TVPB_cm33_core0))
#include "MCXN537T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN537TVAB_cm33_core1) || defined(CPU_MCXN537TVDF_cm33_core1) || defined(CPU_MCXN537TVKL_cm33_core1) || defined(CPU_MCXN537TVPB_cm33_core1))
#include "MCXN537T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN537VAB_cm33_core0) || defined(CPU_MCXN537VDF_cm33_core0) || defined(CPU_MCXN537VKL_cm33_core0) || defined(CPU_MCXN537VPB_cm33_core0))
#include "MCXN537_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN537VAB_cm33_core1) || defined(CPU_MCXN537VDF_cm33_core1) || defined(CPU_MCXN537VKL_cm33_core1) || defined(CPU_MCXN537VPB_cm33_core1))
#include "MCXN537_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN546TVAB_cm33_core0) || defined(CPU_MCXN546TVDF_cm33_core0) || defined(CPU_MCXN546TVKL_cm33_core0) || defined(CPU_MCXN546TVPB_cm33_core0))
#include "MCXN546T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN546TVAB_cm33_core1) || defined(CPU_MCXN546TVDF_cm33_core1) || defined(CPU_MCXN546TVKL_cm33_core1) || defined(CPU_MCXN546TVPB_cm33_core1))
#include "MCXN546T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN546VAB_cm33_core0) || defined(CPU_MCXN546VDF_cm33_core0) || defined(CPU_MCXN546VKL_cm33_core0) || defined(CPU_MCXN546VNL_cm33_core0) || defined(CPU_MCXN546VPB_cm33_core0))
#include "MCXN546_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN546VAB_cm33_core1) || defined(CPU_MCXN546VDF_cm33_core1) || defined(CPU_MCXN546VKL_cm33_core1) || defined(CPU_MCXN546VNL_cm33_core1) || defined(CPU_MCXN546VPB_cm33_core1))
#include "MCXN546_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN547TVAB_cm33_core0) || defined(CPU_MCXN547TVDF_cm33_core0) || defined(CPU_MCXN547TVKL_cm33_core0) || defined(CPU_MCXN547TVPB_cm33_core0))
#include "MCXN547T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN547TVAB_cm33_core1) || defined(CPU_MCXN547TVDF_cm33_core1) || defined(CPU_MCXN547TVKL_cm33_core1) || defined(CPU_MCXN547TVPB_cm33_core1))
#include "MCXN547T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN547VAB_cm33_core0) || defined(CPU_MCXN547VDF_cm33_core0) || defined(CPU_MCXN547VKL_cm33_core0) || defined(CPU_MCXN547VNL_cm33_core0) || defined(CPU_MCXN547VPB_cm33_core0))
#include "MCXN547_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN547VAB_cm33_core1) || defined(CPU_MCXN547VDF_cm33_core1) || defined(CPU_MCXN547VKL_cm33_core1) || defined(CPU_MCXN547VNL_cm33_core1) || defined(CPU_MCXN547VPB_cm33_core1))
#include "MCXN547_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN556SCDF_cm33_core0))
#include "MCXN556S_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN556SCDF_cm33_core1))
#include "MCXN556S_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN556TCAB_cm33_core0) || defined(CPU_MCXN556TCDF_cm33_core0) || defined(CPU_MCXN556TVAB_cm33_core0) || defined(CPU_MCXN556TVDF_cm33_core0))
#include "MCXN556T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN556TCAB_cm33_core1) || defined(CPU_MCXN556TCDF_cm33_core1) || defined(CPU_MCXN556TVAB_cm33_core1) || defined(CPU_MCXN556TVDF_cm33_core1))
#include "MCXN556T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN557SCDF_cm33_core0))
#include "MCXN557S_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN557SCDF_cm33_core1))
#include "MCXN557S_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN557TCAB_cm33_core0) || defined(CPU_MCXN557TCDF_cm33_core0) || defined(CPU_MCXN557TVAB_cm33_core0) || defined(CPU_MCXN557TVDF_cm33_core0))
#include "MCXN557T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN557TCAB_cm33_core1) || defined(CPU_MCXN557TCDF_cm33_core1) || defined(CPU_MCXN557TVAB_cm33_core1) || defined(CPU_MCXN557TVDF_cm33_core1))
#include "MCXN557T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN946TVAB_cm33_core0) || defined(CPU_MCXN946TVDF_cm33_core0) || defined(CPU_MCXN946TVKL_cm33_core0) || defined(CPU_MCXN946TVPB_cm33_core0))
#include "MCXN946T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN946TVAB_cm33_core1) || defined(CPU_MCXN946TVDF_cm33_core1) || defined(CPU_MCXN946TVKL_cm33_core1) || defined(CPU_MCXN946TVPB_cm33_core1))
#include "MCXN946T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN946VAB_cm33_core0) || defined(CPU_MCXN946VDF_cm33_core0) || defined(CPU_MCXN946VKL_cm33_core0) || defined(CPU_MCXN946VNL_cm33_core0) || defined(CPU_MCXN946VPB_cm33_core0))
#include "MCXN946_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN946VAB_cm33_core1) || defined(CPU_MCXN946VDF_cm33_core1) || defined(CPU_MCXN946VKL_cm33_core1) || defined(CPU_MCXN946VNL_cm33_core1) || defined(CPU_MCXN946VPB_cm33_core1))
#include "MCXN946_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN947TVAB_cm33_core0) || defined(CPU_MCXN947TVDF_cm33_core0) || defined(CPU_MCXN947TVKL_cm33_core0) || defined(CPU_MCXN947TVPB_cm33_core0))
#include "MCXN947T_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN947TVAB_cm33_core1) || defined(CPU_MCXN947TVDF_cm33_core1) || defined(CPU_MCXN947TVKL_cm33_core1) || defined(CPU_MCXN947TVPB_cm33_core1))
#include "MCXN947T_cm33_core1_COMMON.h"
#elif (defined(CPU_MCXN947VAB_cm33_core0) || defined(CPU_MCXN947VDF_cm33_core0) || defined(CPU_MCXN947VKL_cm33_core0) || defined(CPU_MCXN947VNL_cm33_core0) || defined(CPU_MCXN947VPB_cm33_core0))
#include "MCXN947_cm33_core0_COMMON.h"
#elif (defined(CPU_MCXN947VAB_cm33_core1) || defined(CPU_MCXN947VDF_cm33_core1) || defined(CPU_MCXN947VKL_cm33_core1) || defined(CPU_MCXN947VNL_cm33_core1) || defined(CPU_MCXN947VPB_cm33_core1))
#include "MCXN947_cm33_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- VREF Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VREF_Peripheral_Access_Layer VREF Peripheral Access Layer
 * @{
 */

/** VREF - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CSR;                               /**< Control and Status, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t UTRIM;                             /**< User Trim, offset: 0x10 */
} VREF_Type;

/* ----------------------------------------------------------------------------
   -- VREF Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VREF_Register_Masks VREF Register Masks
 * @{
 */

/*! @name VERID - Version ID */
/*! @{ */

#define VREF_VERID_FEATURE_MASK                  (0xFFFFU)
#define VREF_VERID_FEATURE_SHIFT                 (0U)
/*! FEATURE - Feature Specification Number */
#define VREF_VERID_FEATURE(x)                    (((uint32_t)(((uint32_t)(x)) << VREF_VERID_FEATURE_SHIFT)) & VREF_VERID_FEATURE_MASK)

#define VREF_VERID_MINOR_MASK                    (0xFF0000U)
#define VREF_VERID_MINOR_SHIFT                   (16U)
/*! MINOR - Minor Version Number */
#define VREF_VERID_MINOR(x)                      (((uint32_t)(((uint32_t)(x)) << VREF_VERID_MINOR_SHIFT)) & VREF_VERID_MINOR_MASK)

#define VREF_VERID_MAJOR_MASK                    (0xFF000000U)
#define VREF_VERID_MAJOR_SHIFT                   (24U)
/*! MAJOR - Major Version Number */
#define VREF_VERID_MAJOR(x)                      (((uint32_t)(((uint32_t)(x)) << VREF_VERID_MAJOR_SHIFT)) & VREF_VERID_MAJOR_MASK)
/*! @} */

/*! @name CSR - Control and Status */
/*! @{ */

#define VREF_CSR_HCBGEN_MASK                     (0x1U)
#define VREF_CSR_HCBGEN_SHIFT                    (0U)
/*! HCBGEN - HC Bandgap Enabled
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_HCBGEN(x)                       (((uint32_t)(((uint32_t)(x)) << VREF_CSR_HCBGEN_SHIFT)) & VREF_CSR_HCBGEN_MASK)

#define VREF_CSR_LPBGEN_MASK                     (0x2U)
#define VREF_CSR_LPBGEN_SHIFT                    (1U)
/*! LPBGEN - Low-Power Bandgap Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_LPBGEN(x)                       (((uint32_t)(((uint32_t)(x)) << VREF_CSR_LPBGEN_SHIFT)) & VREF_CSR_LPBGEN_MASK)

#define VREF_CSR_LPBG_BUF_EN_MASK                (0x4U)
#define VREF_CSR_LPBG_BUF_EN_SHIFT               (2U)
/*! LPBG_BUF_EN - Low-Power Bandgap Buffer Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_LPBG_BUF_EN(x)                  (((uint32_t)(((uint32_t)(x)) << VREF_CSR_LPBG_BUF_EN_SHIFT)) & VREF_CSR_LPBG_BUF_EN_MASK)

#define VREF_CSR_CHOPEN_MASK                     (0x8U)
#define VREF_CSR_CHOPEN_SHIFT                    (3U)
/*! CHOPEN - Chop Oscillator Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_CHOPEN(x)                       (((uint32_t)(((uint32_t)(x)) << VREF_CSR_CHOPEN_SHIFT)) & VREF_CSR_CHOPEN_MASK)

#define VREF_CSR_ICOMPEN_MASK                    (0x10U)
#define VREF_CSR_ICOMPEN_SHIFT                   (4U)
/*! ICOMPEN - Current Compensation Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_ICOMPEN(x)                      (((uint32_t)(((uint32_t)(x)) << VREF_CSR_ICOMPEN_SHIFT)) & VREF_CSR_ICOMPEN_MASK)

#define VREF_CSR_REGEN_MASK                      (0x20U)
#define VREF_CSR_REGEN_SHIFT                     (5U)
/*! REGEN - Regulator Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_REGEN(x)                        (((uint32_t)(((uint32_t)(x)) << VREF_CSR_REGEN_SHIFT)) & VREF_CSR_REGEN_MASK)

#define VREF_CSR_HI_PWR_LV_MASK                  (0x800U)
#define VREF_CSR_HI_PWR_LV_SHIFT                 (11U)
/*! HI_PWR_LV - High-Power Level
 *  0b0..Low-power
 *  0b1..High-power
 */
#define VREF_CSR_HI_PWR_LV(x)                    (((uint32_t)(((uint32_t)(x)) << VREF_CSR_HI_PWR_LV_SHIFT)) & VREF_CSR_HI_PWR_LV_MASK)

#define VREF_CSR_BUF21EN_MASK                    (0x10000U)
#define VREF_CSR_BUF21EN_SHIFT                   (16U)
/*! BUF21EN - Internal Buffer21 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define VREF_CSR_BUF21EN(x)                      (((uint32_t)(((uint32_t)(x)) << VREF_CSR_BUF21EN_SHIFT)) & VREF_CSR_BUF21EN_MASK)

#define VREF_CSR_VREFST_MASK                     (0x80000000U)
#define VREF_CSR_VREFST_SHIFT                    (31U)
/*! VREFST - Internal HC Voltage Reference Stable
 *  0b0..Disabled and unstable
 *  0b1..Stable
 */
#define VREF_CSR_VREFST(x)                       (((uint32_t)(((uint32_t)(x)) << VREF_CSR_VREFST_SHIFT)) & VREF_CSR_VREFST_MASK)
/*! @} */

/*! @name UTRIM - User Trim */
/*! @{ */

#define VREF_UTRIM_TRIM2V1_MASK                  (0xFU)
#define VREF_UTRIM_TRIM2V1_SHIFT                 (0U)
/*! TRIM2V1 - VREF 2.1 V Trim */
#define VREF_UTRIM_TRIM2V1(x)                    (((uint32_t)(((uint32_t)(x)) << VREF_UTRIM_TRIM2V1_SHIFT)) & VREF_UTRIM_TRIM2V1_MASK)

#define VREF_UTRIM_VREFTRIM_MASK                 (0x3F00U)
#define VREF_UTRIM_VREFTRIM_SHIFT                (8U)
/*! VREFTRIM - VREF Trim */
#define VREF_UTRIM_VREFTRIM(x)                   (((uint32_t)(((uint32_t)(x)) << VREF_UTRIM_VREFTRIM_SHIFT)) & VREF_UTRIM_VREFTRIM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group VREF_Register_Masks */


/*!
 * @}
 */ /* end of group VREF_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_VREF_H_ */

